import java.io.IOException;
import java.util.Scanner;

/**
 * Напишите приложение, которое будет запрашивать у пользователя следующие
 * данные в произвольном
 * порядке, разделенные пробелом:
 * Фамилия Имя Отчество датарождения номертелефона пол
 * Форматы данных:
 * фамилия, имя, отчество - строки
 * дата_рождения - строка формата dd.mm.yyyy
 * номер_телефона - целое беззнаковое число без форматирования
 * пол - символ латиницей f или m.
 * 
 * Приложение должно проверить введенные данные по количеству. Если количество
 * не совпадает с
 * требуемым, вернуть код ошибки, обработать его и показать пользователю
 * сообщение, что он ввел
 * меньше и больше данных, чем требуется.
 * Приложение должно попытаться распарсить полученные значения и выделить из них
 * требуемые параметры.
 * Если форматы данных не совпадают, нужно бросить исключение, соответствующее
 * типу проблемы.
 * Можно использовать встроенные типы java и создать свои. Исключение должно
 * быть корректно обработано,
 * пользователю выведено сообщение с информацией, что именно неверно.
 * Если всё введено и обработано верно, должен создаться файл с названием,
 * равным фамилии,
 * в него в одну строку должны записаться полученные данные, вида
 * 
 * <Фамилия><Имя><Отчество><датарождения> <номертелефона><пол>
 * Однофамильцы должны записаться в один и тот же файл, в отдельные строки.
 * Не забудьте закрыть соединение с файлом.
 * При возникновении проблемы с чтением-записью в файл, исключение должно быть
 * корректно обработано,
 * пользователь должен увидеть стектрейс ошибки.
 */
public class Program {
    public static void main(String[] args) {
        try {
            FileService service = new FileService();
            final String coding = "cp866";
            System.setProperty("console.encoding", coding);
            Scanner in = new Scanner(System.in, coding);
            System.out.println(
                    "Введите данные через пробел: \n 1.Фамилия\n 2.Имя\n 3.Отчество\n 4.Дата рождения в формате dd.mm.yyyy\n 5.Номер телефона\n 6.Пол символом латиницей f или m ");
            String consoleText = in.nextLine();
            ParserItem parser = new ParserItem();
            Item data = parser.parceData(consoleText);
            service.SaveFile(data);
            in.close();
        } catch (IOException e) {
            System.out.println("Ошибка: " + e.getMessage() + e.getStackTrace());
        } catch (Exception e) {
            System.out.println("Ошибка: " + e.getMessage());
        }
    }
}
